tap "homebrew/bundle"

# ── CLI / Shell ──────────────────────────────────────────────
brew "fzf"                        # 퍼지 파인더
brew "gh"                         # GitHub CLI
brew "git-lfs"                    # 대용량 파일
brew "neovim"                     # 에디터
brew "tree"                       # 디렉토리 트리 뷰
brew "zsh-autosuggestions"        # zsh 자동완성
brew "zsh-syntax-highlighting"    # zsh 문법 강조

# ── Language Runtimes ────────────────────────────────────────
brew "go"
brew "openjdk"
brew "python@3.11"
brew "pipenv"
brew "yarn"
# nvm은 brew 대신 공식 install 스크립트 권장 (https://github.com/nvm-sh/nvm)

# ── Apps ─────────────────────────────────────────────────────
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "visual-studio-code"
cask "fork"                       # Git GUI
cask "postman"                    # API 클라이언트
cask "dbeaver-community"          # DB 클라이언트
cask "obsidian"                   # 노트
cask "rectangle"                  # 윈도우 매니저

# ── 개인 환경 일관성 (dotfiles로 설정 동기화 필요) ─────────────
cask "karabiner-elements"         # ~/.config/karabiner 동기화 필수
cask "scroll-reverser"
cask "shottr"                     # 스크린샷

# ── VS Code Extensions ───────────────────────────────────────
# (VS Code Settings Sync 사용 시 중복이지만, 새 PC 부팅 시 일괄 설치용)
vscode "adpyke.vscode-sql-formatter"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "rvest.vs-code-prettier-eslint"
vscode "vncz.vscode-apielements"
vscode "vscjava.vscode-gradle"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
